#include <iostream>
#include <fstream>

int main()
{
	using namespace std;
	setlocale(0, "");

	ofstream outf("txt.txt", ios::app);
	int x1, y1, x2, y2, a, c11, c21, c12, c22;
	cout << "Введите координату первой фигуры по горизонтали (целое число 1 <= N <= 8): ";
	cin >> x1;
	outf << x1 << endl;
	cout << "Введите координату первой фигуры по вертикали (целое число 1 <= N <= 8): ";
	cin >> y1;
	outf << y1 << endl;
	cout << "Что это за фигура? '1' - ферзь, '2' - ладья, '3' - слон, '4' - конь: ";
	cin >> a;
	outf << a << endl;
	cout << "Введите координату второй фигуры по горизонтали (целое число 1 <= N <= 8): ";
	cin >> x2;
	outf << x2 << endl;
	cout << "Введите координату второй фигуры по вертикали (целое число 1 <= N <= 8): ";
	cin >> y2;
	outf << y2 << endl;

	if ((x1 + y1) % 2 == (x2 + y2) % 2) {
		cout << "\nКлетки одного цвета\n";
		outf << "\nКлетки одного цвета\n";
	}
	else {
		cout << "\nКлетки разного цвета\n";
		outf << "\nКлетки разного цвета\n";
	}

	switch (a) {
	case 1:
		if ((x1 == x2) || (y1 == y2) || (x1 - x2 == y1 - y2) || (x1 - x2 == y2 - y1)) {
			cout << "Из клетки (" << x1 << "," << y1 << ") ферзь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") ферзь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
		}
		else {
			cout << "Из клетки (" << x1 << "," << y1 << ") ферзь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (" << x1 << "," << y2 << ");\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") ферзь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (" << x1 << "," << y2 << ");\n";
		}
		break;
	case 2:
		if ((x1 == x2) || (y1 == y2)) {
			cout << "Из клетки (" << x1 << "," << y1 << ") ладья может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") ладья может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
		}
		else {
			cout << "Из клетки (" << x1 << "," << y1 << ") ладья может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (" << x1 << "," << y2 << ");\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") ладья может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (" << x1 << "," << y2 << ");\n";
		}
		break;
	case 3:
		if ((x1 + y1) % 2 != (x2 + y2) % 2) {
			cout << "Из клетки (" << x1 << "," << y1 << ") слон вообще не сможет срубить фигуру в клетке (" << x2 << "," << y2 << ");\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") слон вообще не сможет срубить фигуру в клетке (" << x2 << "," << y2 << ");\n";
		}
		else {
			if ((x1 - x2 == y1 - y2) || (x1 - x2 == y2 - y1)) {
				cout << "Из клетки (" << x1 << "," << y1 << ") слон может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
				outf << "Из клетки (" << x1 << "," << y1 << ") слон может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
			}
			else {
				cout << "Из клетки (" << x1 << "," << y1 << ") слон может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (";
				outf << "Из клетки (" << x1 << "," << y1 << ") слон может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 2 хода, промежуточная клетка: (";
				c11 = y1 - x1;
				c12 = -x1 - y1;
				c21 = y2 - x2;
				c22 = -x2 - y2;
				if (((-c11-c22)/2 > 0) && ((-c11 - c22) / 2 < 9) && ((c11 - c22) / 2 > 0) && ((c11 - c22) / 2 < 9)) {
					cout << (-c11 - c22) / 2 << "," << (c11 - c22) / 2 << ")\n";
					outf << (-c11 - c22) / 2 << "," << (c11 - c22) / 2 << ")\n";
				}
				else {
					cout << (-c12 - c21) / 2 << "," << (c21 - c12) / 2 << ")\n";
					outf << (-c12 - c21) / 2 << "," << (c21 - c12) / 2 << ")\n";
				}
			}
		}
		break;
	case 4:
		if ((x1 + 1 == x2) && (y1 + 2 == y2) || (x1 - 1 == x2) && (y1 + 2 == y2) || (x1 + 2 == x2) && (y1 + 1 == y2) || (x1 - 1 == x2) && (y1 + 2 == y2) || (x1 + 1 == x2) && (y1 - 2 == y2) || (x1 - 1 == x2) && (y1 - 2 == y2) || (x1 - 2 == x2) && (y1 - 1 == y2) || (x1 - 2 == x2) && (y1 + 1 == y2)) {
			cout << "Из клетки (" << x1 << "," << y1 << ") конь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") конь может срубить фигуру в клетке (" << x2 << "," << y2 << ") за 1 ход;\n";
		}
		else {
			cout << "Из клетки (" << x1 << "," << y1 << ") конь вообще не сможет срубить фигуру в клетке (" << x2 << "," << y2 << ");\n";
			outf << "Из клетки (" << x1 << "," << y1 << ") конь вообще не сможет срубить фигуру в клетке (" << x2 << "," << y2 << ");\n";
		}
		break;
	}
	outf << "\n\n\n";
	outf.close();

	return 0;
}

